tiborsimon/embedded-tdd-headers/pic/pic18/pic18f86j72_tdd.h
#define SEG12                         522
#define RC5                           523
#define SDO                           524
#define SEG27                         525
#define TX1                           526
#define RC6                           527
#define CK1                           528
#define RX1                           529
#define SEG28                         530
#define RC7                           531
#define DT1                           532
#define PORTD                         533
#define RD0                           534
#define SEG0                          535
#define CTPLS                         536
#define RD1                           537
#define SEG1                          538
#define RD2                           539
#define SEG2                          540
#define RD3                           541
#define SEG3                          542
#define RD4                           543
#define SEG4                          544
#define RD5                           545
#define SEG5                          546
#define RD6                           547
#define SEG6                          548
#define RD7                           549
#define SEG7                          550
#define SS2                           551
#define PORTE                         552
#define PD2                           553
#define RDE                           554
#define LCDBIAS1                      555
#define RE0                           556
#define WRE                           557
#define LCDBIAS2                      558
#define PC2                           559
#define RE1                           560
#define COM0                          561
#define CCP9E                         562
#define RE3                           563
#define PC3E                          564
#define PB3E                          565
#define COM1                          566
#define RE4                           567
#define CCP8E                         568
#define COM2                          569
#define CCP7E                         570
#define RE5                           571
#define PC1E                          572
#define CCP6E                         573
#define COM3                          574
#define RE6                           575
#define PB1E                          576
#define PORTE_CCP2                    577
#define CCP2E                         578
#define SEG31                         579
#define PA2E                          580
#define RE7                           581
#define PORTF                         582
#define SEG19                         583
#define C2OUTF                        584
#define AN6                           585
#define PORTF_C2OUT                   586
#define RF1                           587
#define PORTF_C1OUT                   588
#define AN7                           589
#define RF2                           590
#define C1OUTF                        591
#define SEG20                         592
#define AN8                           593
#define RF3                           594
#define SEG21                         595
#define C2INB                         596
#define AN9                           597
#define RF4                           598
#define SEG22                         599
#define C2INA                         600
#define C1INB                         601
#define RF5                           602
#define SEG23                         603
#define CVREF                         604
#define AN10                          605
#define C1INA                         606
#define RF6                           607
#define SEG24                         608
#define AN11                          609
#define SS1                           610
#define AN5                           611
#define RF7                           612
#define SEG25                         613
#define PORTG                         614
#define LCDBIAS0                      615
#define RG0                           616
#define C3OUTG                        617
#define TX2                           618
#define RG1                           619
#define CK2                           620
#define VLCAP1                        621
#define RX2                           622
#define RG2                           623
#define DT2                           624
#define VLCAP2                        625
#define RG3                           626
#define SEG26                         627
#define RG4                           628
#define RTCC                          629
#define PORTG_RJPU                    630
#define RG5                           631
#define REPU                          632
#define RG6                           633
#define RDPU                          634
#define RG7                           635
#define LATA                          636
#define LATA0                         637
#define LA0                           638
#define LATA1                         639
#define LA1                           640
#define LATA2                         641
#define LA2                           642
#define LATA3                         643
#define LA3                           644
#define LATA4                         645
#define LA4                           646
#define LATA5                         647
#define LA5                           648
#define LATA6                         649
#define LA6                           650
#define LATA7                         651
#define LA7                           652
#define LATB                          653
#define LB0                           654
#define LATB0                         655
#define LB1                           656
#define LATB1                         657
#define LB2                           658
#define LATB2                         659
#define LB3                           660
#define LATB3                         661
#define LB4                           662
#define LATB4                         663
#define LB5                           664
#define LATB5                         665
#define LB6                           666
#define LATB6                         667
#define LB7                           668
#define LATB7                         669
#define LATC                          670
#define LATC0                         671
#define LC0                           672
#define LATC1                         673
#define LC1                           674
#define LATC2                         675
#define LC2                           676
#define LATC3                         677
#define LC3                           678
#define LATC4                         679
#define LC4                           680
#define LATC5                         681
#define LC5                           682
#define LATC6                         683
#define LC6                           684
#define LATC7                         685
#define LC7                           686
#define LATD                          687
#define LATD0                         688
#define LD0                           689
#define LATD1                         690
#define LD1                           691
#define LATD2                         692
#define LD2                           693
#define LATD3                         694
#define LD3                           695
#define LATD4                         696
#define LD4                           697
#define LATD5                         698
#define LD5                           699
#define LATD6                         700
#define LD6                           701
#define LATD7                         702
#define LD7                           703
#define LATE                          704
#define LATE0                         705
#define LE0                           706
#define LATE1                         707
#define LE1                           708
#define LATE3                         709
#define LE3                           710
#define LATE4                         711
#define LE4                           712
#define LATE5                         713
#define LE5                           714
#define LATE6                         715
#define LE6                           716
#define LATE7                         717
#define LE7                           718
#define LATF                          719
#define LATF1                         720
#define LF1                           721
#define LF2                           722
#define LATF2                         723
#define LF3                           724
#define LATF3                         725
#define LF4                           726
#define LATF4                         727
#define LF5                           728
#define LATF5                         729
#define LF6                           730
#define LATF6                         731
#define LF7                           732
#define LATF7                         733
#define LATG                          734
#define LATG0                         735
#define LG0                           736
#define LATG1                         737
#define LG1                           738
#define LG2                           739
#define LATG2                         740
#define LATG3                         741
#define LG3                           742
#define LATG4                         743
#define LG4                           744
#define U1OD                          745
#define U2OD                          746
#define TRISA                         747
#define TRISA0                        748
#define TRISA1                        749
#define TRISA2                        750
#define TRISA3                        751
#define TRISA4                        752
#define TRISA5                        753
#define TRISA6                        754
#define TRISA7                        755
#define TRISB                         756
#define TRISB0                        757
#define TRISB1                        758
#define TRISB2                        759
#define TRISB3                        760
#define TRISB4                        761
#define TRISB5                        762
#define TRISB6                        763
#define TRISB7                        764
#define TRISC                         765
#define TRISC0                        766
#define TRISC1                        767
#define TRISC2                        768
#define TRISC3                        769
#define TRISC4                        770
#define TRISC5                        771
#define TRISC6                        772
#define TRISC7                        773
#define TRISD                         774
#define TRISD0                        775
#define TRISD1                        776
#define TRISD2                        777
#define TRISD3                        778
#define TRISD4                        779
#define TRISD5                        780
#define TRISD6                        781
#define TRISD7                        782
#define TRISE                         783
#define TRISE0                        784
#define TRISE1                        785
#define TRISE3                        786
#define TRISE4                        787
#define TRISE5                        788
#define TRISE6                        789
#define TRISE7                        790
#define TRISF                         791
#define TRISF1                        792
#define TRISF2                        793
#define TRISF3                        794
#define TRISF4                        795
#define TRISF5                        796
#define TRISF6                        797
#define TRISF7                        798
#define TRISG                         799
#define TRISG0                        800
#define TRISG1                        801
#define TRISG2                        802
#define TRISG3                        803
#define TRISG4                        804
#define CCP1OD                        805
#define CCP2OD                        806
#define SPIOD                         807
#define OSCTUNE                       808
#define TUN0                          809
#define TUN                           810
#define TUN1                          811
#define TUN2                          812
#define TUN3                          813
#define TUN4                          814
#define TUN5                          815
#define PLLEN                         816
#define INTSRC                        817
#define PIE1                          818
#define TMR1IE                        819
#define TMR2IE                        820
#define SSPIE                         821
#define SSP1IE                        822
#define TXIE                          823
#define TX1IE                         824
#define RCIE                          825
#define RC1IE                         826
#define ADIE                          827
#define PIR1                          828
#define TMR1IF                        829
#define TMR2IF                        830
#define SSP1IF                        831
#define SSPIF                         832
#define TXIF                          833
#define TX1IF                         834
#define RCIF                          835
#define RC1IF                         836
#define ADIF                          837
#define IPR1                          838
#define TMR1IP                        839
#define TMR2IP                        840
#define SSPIP                         841
#define SSP1IP                        842
#define TX1IP                         843
#define TXIP                          844
#define RCIP                          845
#define RC1IP                         846
#define ADIP                          847
#define PIE2                          848
#define TMR3IE                        849
#define LVDIE                         850
#define BCLIE                         851
#define BCL1IE                        852
#define CMIE                          853
#define OSCFIE                        854
#define PIR2                          855
#define TMR3IF                        856
#define LVDIF                         857
#define BCL1IF                        858
#define BCLIF                         859
#define CMIF                          860
#define OSCFIF                        861
#define IPR2                          862
#define TMR3IP                        863
#define LVDIP                         864
#define BCL1IP                        865
#define BCLIP                         866
#define CMIP                          867
#define OSCFIP                        868
#define PIE3                          869
#define RTCCIE                        870
#define RXB0IE                        871
#define RXBNIE                        872
#define CCP1IE                        873
#define RXB1IE                        874
#define CCP2IE                        875
#define TXB0IE                        876
#define CTMUIE                        877
#define TXB1IE                        878
#define TXB2IE                        879
#define TXBNIE                        880
#define TX2IE                         881
#define RC2IE                         882
#define LCDIE                         883
#define PIR3                          884
#define RTCCIF                        885
#define RXBNIF                        886
#define CCP1IF                        887
#define CCP2IF                        888
#define CTMUIF                        889
#define TXBNIF                        890
#define TX2IF                         891
#define RC2IF                         892
#define LCDIF                         893
#define IPR3                          894
#define RTCCIP                        895
#define CCP1IP                        896
#define RXBNIP                        897
#define CCP2IP                        898
#define CTMUIP                        899
#define TX2IP                         900
#define TXBNIP                        901
#define RC2IP                         902
#define LCDIP                         903
#define EECON1                        904
#define WR                            905
#define WREN                          906
#define WRERR                         907
#define FREE                          908
#define WPROG                         909
#define EECON2                        910
#define LCDCON                        911
#define LMUX0                         912
#define LMUX1                         913
#define CS0                           914
#define LCDCS0                        915
#define CS1                           916
#define LCDCS1                        917
#define WERR                          918
#define LCDWERR                       919
#define LCDSLPEN                      920
#define SLPEN                         921
#define LCDEN                         922
#define LCDSE0                        923
#define SE0                           924
#define SEGEN0                        925
#define SE00                          926
#define SE1                           927
#define SEGEN1                        928
#define SE01                          929
#define SE2                           930
#define SEGEN2                        931
#define SE02                          932
#define SE3                           933
#define SEGEN3                        934
#define SE03                          935
#define SE4                           936
#define SEGEN4                        937
#define SE04                          938
#define SE5                           939
#define SE05                          940
#define SEGEN5                        941
#define SE6                           942
#define SE06                          943
#define SEGEN6                        944
#define SE07                          945
#define SE7                           946
#define SEGEN7                        947
#define LCDPS                         948
#define LP0                           949
#define LCDPS0                        950
#define LP1                           951
#define LCDPS1                        952
#define LP2                           953
#define LCDPS2                        954
#define LP3                           955
#define LCDPS3                        956
#define WA                            957
#define LCDA                          958
#define BIASMD                        959
#define WFT                           960
#define RCSTA1                        961
#define RCSTA1_RX9D                   962
#define RX9D1                         963
#define RCSTA1_RCD8                   964
#define RCSTA1_OERR                   965
#define OERR1                         966
#define RCSTA1_FERR                   967
#define FERR1                         968
#define RCSTA1_ADDEN                  969
#define ADDEN1                        970
#define ADEN                          971
#define RCSTA1_CREN                   972
#define CREN1                         973
#define SRENA                         974
#define SREN1                         975
#define RCSTA1_SREN                   976
#define RCSTA1_NOT_RC8                977
#define RCSTA1_RC9                    978
#define RCSTA1_RC8_9                  979
#define RCSTA1_RX9                    980
#define nRC8                          981
#define RX91                          982
#define RCSTA1_SPEN                   983
#define SPEN1                         984
#define TXSTA1                        985
#define TX9D1                         986
#define TXSTA1_TX9D                   987
#define TXSTA1_TXD8                   988
#define TRMT1                         989
#define TXSTA1_TRMT                   990
#define BRGH1                         991
#define TXSTA1_BRGH                   992
#define SENDB1                        993
#define SENDB                         994
#define TXSTA1_SYNC                   995
#define SYNC1                         996
#define TXEN1                         997
#define TXSTA1_TXEN                   998
#define TX91                          999
#define TXSTA1_NOT_TX8                1000
#define TXSTA1_TX8_9                  1001
#define TXSTA1_TX9                    1002
#define nTX8                          1003
#define TXSTA1_CSRC                   1004
#define CSRC1                         1005
#define TXREG1                        1006
#define RCREG1                        1007
#define SPBRG1                        1008
#define T3CON                         1009
#define TMR3ON                        1010
#define TMR3CS                        1011
#define nT3SYNC                       1012
#define NOT_T3SYNC                    1013
#define T3SYNC                        1014
#define T3INSYNC                      1015
#define SOSCEN3                       1016
#define T3CCP1                        1017
#define T3CKPS                        1018
#define T3CKPS0                       1019
#define T3CKPS1                       1020
#define T3CCP2                        1021
#define T3CON_RD16                    1022
#define RD163                         1023
#define T3RD16                        1024
#define TMR3L                         1025
#define TMR3H                         1026
#define CMCON                         1027
#define CMEN0                         1028
#define CMCON_CM                      1029
#define CM0                           1030
#define CMEN1                         1031
#define CM1                           1032
#define CMEN2                         1033
#define CM2                           1034
#define CIS                           1035
#define C1INV                         1036
#define C2INV                         1037
#define CMCON_C1OUT                   1038
#define CMCON_C2OUT                   1039
#define CVRCON                        1040
#define CVR                           1041
#define CVR0                          1042
#define CVR1                          1043
#define CVR2                          1044
#define CVR3                          1045
#define CVRSS                         1046
#define CVRR                          1047
#define CVROEN                        1048
#define CVROE                         1049
#define CVREN                         1050
#define SE08                          1051
#define SE8                           1052
#define SEGEN8                        1053
#define LCDSE1                        1054
#define SEGEN9                        1055
#define SE09                          1056
#define SE9                           1057
#define SEGEN10                       1058
#define SE10                          1059
#define SEGEN11                       1060
#define SE11                          1061
#define SEGEN12                       1062
#define SE12                          1063
#define SEGEN13                       1064
#define SE13                          1065
#define SEGEN14                       1066
#define SE14                          1067
#define SEGEN15                       1068
#define SE15                          1069
#define SEGEN16                       1070
#define LCDSE2                        1071
#define SE16                          1072
#define SEGEN17                       1073
#define SE17                          1074
#define SEGEN18                       1075
#define SE18                          1076
#define SEGEN19                       1077
#define SE19                          1078
#define SE20                          1079
#define SEGEN20                       1080
#define SE21                          1081
#define SEGEN21                       1082
#define SEGEN22                       1083
#define SE22                          1084
#define SEGEN23                       1085
#define SE23                          1086
#define SE24                          1087
#define SEGEN24                       1088
#define LCDSE3                        1089
#define SE25                          1090
